saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM3_DFP.1.4.0.pdsc
          <!--book name="Documents/NotAvailable.pdf" title="TMPM342FYXBG Reference Manual"/-->

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="1"/>
          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="ADC"           n="4"       m="16"              name="16-Bit Delta-Sigma A/D converters"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="Timer"         n="8"       m="16"              name="Hi-resolution 16Bit Timer"/>
          <feature type="Timer"         n="2"                           name="2-phase pulse counter(PHC)"/>
          <feature type="Other"         n="1"                           name="Servo/Sequence Controller"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="63"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="BGA"           n="142"/>
        </device>

        <!-- *************************  Device 'TMPM343F10XBG'  ***************************** -->
        <device Dname="TMPM343F10XBG">
          <processor Dclock="50000000"/>
          <compile header="Device/Include/TMPM343.h"/>
          <debug svd="SVD/M343.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM343_1024.FLM" start="0x00000000" size="0x00100000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM343F10XBG Reference Manual"/-->

          <feature type="DMA"           n="6"/>
          <feature type="UART"          n="1"/>
          <feature type="UART"          n="1"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="6"       m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="16"      m="16"              name="Hi-resolution 16Bit Timer"/>
          <feature type="Timer"         n="3"                           name="2-phase pulse counter(PHC)"/>
          <feature type="Other"         n="4"                           name="Servo/Sequence Controller"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="42"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="BGA"           n="162"/>
        </device>

        <!-- *************************  Device 'TMPM343FDXBG'  ***************************** -->
        <device Dname="TMPM343FDXBG">
          <processor Dclock="50000000"/>
          <compile header="Device/Include/TMPM343.h"/>
          <debug svd="SVD/M343.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM343_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM343FDXBG Reference Manual"/-->

          <feature type="DMA"           n="6"/>
          <feature type="UART"          n="1"/>
          <feature type="UART"          n="1"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="6"       m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="16"      m="16"              name="Hi-resolution 16Bit Timer"/>
          <feature type="Timer"         n="3"                           name="2-phase pulse counter(PHC)"/>
          <feature type="Other"         n="4"                           name="Servo/Sequence Controller"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="42"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="BGA"           n="162"/>
        </device>

        <!-- *************************  Device 'TMPM343FEXBG'  ***************************** -->
        <device Dname="TMPM343FEXBG">
          <processor Dclock="50000000"/>
          <compile header="Device/Include/TMPM343.h"/>
          <debug svd="SVD/M343.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x000C0000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM343_768.FLM" start="0x00000000" size="0x000C0000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM343FEXBG Reference Manual"/-->

          <feature type="DMA"           n="6"/>
          <feature type="UART"          n="1"/>
          <feature type="UART"          n="1"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="6"       m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="16"      m="16"              name="Hi-resolution 16Bit Timer"/>
          <feature type="Timer"         n="3"                           name="2-phase pulse counter(PHC)"/>
          <feature type="Other"         n="4"                           name="Servo/Sequence Controller"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="42"/>
          <feature type="VCC"           n="2.70"    m="3.60"/>
          <feature type="BGA"           n="162"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'M360'  **************************** -->
      <subFamily DsubFamily="M360">
        <feature type="VCC"           n="2.70"    m="3.60"/>

        <!-- *************************  Device 'TMPM361F10FG'  ***************************** -->
        <device Dname="TMPM361F10FG">
          <processor Dclock="64000000"/>
          <compile header="Device/Include/TMPM361.h"/>
          <debug svd="SVD/M361.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_1024.FLM" start="0x00000000" size="0x00100000"             default="1"/>

          <book name="Documents/TMPM361F10FG_datasheet_en_20130531.pdf" title="M361F10FG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="5"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="76"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM361FDFG'  ***************************** -->
        <device Dname="TMPM361FDFG">
          <processor Dclock="64000000"/>
          <compile header="Device/Include/TMPM361.h"/>
          <debug svd="SVD/M361.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000A000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM361FDFG Reference Manual"/-->

          <feature type="DMA"           n="2"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="5"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="76"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM361FYFG'  ***************************** -->
        <device Dname="TMPM361FYFG">
          <processor Dclock="64000000"/>
          <compile header="Device/Include/TMPM361.h"/>
          <debug svd="SVD/M361.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM361FYFG Reference Manual"/-->

          <feature type="DMA"           n="2"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="5"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="76"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

