saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM3_DFP.1.4.0.pdsc
        <!-- *************************  Device 'TMPM362F10FG'  ***************************** -->
        <device Dname="TMPM362F10FG">
          <processor Dclock="64000000"/>
          <compile header="Device/Include/TMPM362.h"/>
          <debug svd="SVD/M362.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_1024.FLM" start="0x00000000" size="0x00100000"             default="1"/>

          <book name="Documents/TMPM362F10FG_datasheet_en_20130531.pdf" title="M362F10FG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="12"                          name="UART/SIO"/>
          <feature type="I2C"           n="5"                           name="I2C/SIO"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="2"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="120"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'TMPM363F10FG'  ***************************** -->
        <device Dname="TMPM363F10FG">
          <processor Dclock="64000000"/>
          <compile header="Device/Include/TMPM363.h"/>
          <debug svd="SVD/M363.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_1024.FLM" start="0x00000000" size="0x00100000"             default="1"/>

          <book name="Documents/TMPM363F10FG_datasheet_en_20130531.pdf" title="M363F10FG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="5"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBH"          n="1"                           name="USB Host (Full Speed)"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM364F10FG'  ***************************** -->
        <device Dname="TMPM364F10FG">
          <processor Dclock="64000000"/>
          <compile header="Device/Include/TMPM364.h"/>
          <debug svd="SVD/M364.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_1024.FLM" start="0x00000000" size="0x00100000"             default="1"/>

          <book name="Documents/TMPM364F10FG_datasheet_en_20130531.pdf" title="M364F10FG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="UART"          n="12"                          name="UART/SIO"/>
          <feature type="I2C"           n="5"                           name="I2C/SIO"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBH"          n="1"                           name="USB Host (Full Speed)"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="2"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="118"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'TMPM365FYXBG'  ***************************** -->
        <device Dname="TMPM365FYXBG">
          <processor Dclock="48000000"/>
          <compile header="Device/Include/TMPM365.h"/>
          <debug svd="SVD/M365.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM365_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/TMPM365FYXBG_datasheet_en_20130612.pdf"                     title="M365FYXBG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="105"/>
        </device>

        <!-- *************************  Device 'TMPM366FDFG'  ***************************** -->
        <device Dname="TMPM366FDFG">
          <processor Dclock="48000000"/>
          <compile header="Device/Include/TMPM366.h"/>
          <debug svd="SVD/M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM366FDFG_datasheet_en_20130611.pdf"                      title="M366FDFG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM366FDXBG'  ***************************** -->
        <device Dname="TMPM366FDXBG">
          <processor Dclock="48000000"/>
          <compile header="Device/Include/TMPM366.h"/>
          <debug svd="SVD/M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

