saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM3_DFP.1.4.0.pdsc
        <!-- *************************  Device 'TMPM367FDXBG'  ***************************** -->
        <device Dname="TMPM367FDXBG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM367.h"/>
          <debug svd="SVD/M367.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM367FDXBG_datasheet_en_20131011.pdf" title="M367FDXBG Reference Manual"/>

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="109"/>
        </device>

        <!-- *************************  Device 'TMPM367FWFG'  ***************************** -->
        <device Dname="TMPM367FWFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM367.h"/>
          <debug svd="SVD/M367.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM367FWFG Reference Manual"/-->

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM367FWXBG'  ***************************** -->
        <device Dname="TMPM367FWXBG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM367.h"/>
          <debug svd="SVD/M367.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM367FWXBG Reference Manual"/-->

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="109"/>
        </device>

        <!-- *************************  Device 'TMPM367FYFG'  ***************************** -->
        <device Dname="TMPM367FYFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM367.h"/>
          <debug svd="SVD/M367.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

