saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM3_DFP.1.4.0.pdsc
          <book name="Documents/TMPM373FWDUG_datasheet_en_20130412.pdf" title="M373FWDUG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="37"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'TMPM374FWUG'  ***************************** -->
        <device Dname="TMPM374FWUG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM374.h"/>
          <debug svd="SVD/M374.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM37x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM374FWUG_datasheet_en_20130415.pdf" title="M374FWUG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="ADC"           n="6"       m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="7"/>
          <feature type="IOs"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="44"/>
        </device>

        <!-- *************************  Device 'TMPM375FSDMG'  ***************************** -->
        <device Dname="TMPM375FSDMG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM375.h"/>
          <debug svd="SVD/M375.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM37x_64.FLM" start="0x00000000" size="0x00010000"             default="1"/>

          <book name="Documents/TMPM375FSDMG_datasheet_en_20130830.pdf" title="M375FSDMG Reference Manual"/>

          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C/SIO"/>
          <feature type="ADC"           n="4"       m="12"/>
          <feature type="Timer"         n="4"       m="16"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="3"/>
          <feature type="IOs"           n="21"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="SOP"           n="30"/>
        </device>

        <!-- *************************  Device 'TMPM376FDDFG'  ***************************** -->
        <device Dname="TMPM376FDDFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM376.h"/>
          <debug svd="SVD/M376.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM37x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM376FDDFG_datasheet_en_20130412.pdf" title="M376FDDFG Reference Manual"/>

          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C/SIO"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="82"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM376FDFG'  ***************************** -->
        <device Dname="TMPM376FDFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM376.h"/>
          <debug svd="SVD/M376.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM37x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM376FDFG_datasheet_en_20130412.pdf" title="M376FDFG Reference Manual"/>

          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C/SIO"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="82"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM37AFSQG'  ***************************** -->
        <device Dname="TMPM37AFSQG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM37A.h"/>
          <debug svd="SVD/M37A.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM37x_64.FLM" start="0x00000000" size="0x00010000"             default="1"/>

          <!--book name="Documents/TMPM37AFSQG_datasheet_en_20130412.pdf" title="TMPM37AFSQG Reference Manual"/-->

