saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM3_DFP.1.4.0.pdsc
        <!-- *************************  Device 'TMPM381FWFG'  ****************************** -->
        <device Dname="TMPM381FWFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM381.h"/>
          <debug svd="SVD/M381.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM381_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM381FWFG Reference Manual"/-->

          <feature type="ADC"           n="18"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="CoreOther"     n="1"                           name="Remote control signal preprocessor (RMC)"/>
          <feature type="IOs"           n="83"/>
          <feature type="VCC"           n="3.90"    m="5.50"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM381FWDFG'  ***************************** -->
        <device Dname="TMPM381FWDFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM381.h"/>
          <debug svd="SVD/M381.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM381_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM381FWDFG Reference Manual"/-->

          <feature type="ADC"           n="18"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="CoreOther"     n="1"                           name="Remote control signal preprocessor (RMC)"/>
          <feature type="IOs"           n="83"/>
          <feature type="VCC"           n="3.90"    m="5.50"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM383FWUG'  ***************************** -->
        <device Dname="TMPM383FWUG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM383.h"/>
          <debug svd="SVD/M383.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM383_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM383FWUG Reference Manual"/-->

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="CoreOther"     n="1"                           name="Remote control signal preprocessor (RMC)"/>
          <feature type="IOs"           n="47"/>
          <feature type="VCC"           n="3.90"    m="5.50"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'TMPM383FWEFG'  **************************** -->
        <device Dname="TMPM383FWEFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM383.h"/>
          <debug svd="SVD/M383.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM383_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM383FWEFG Reference Manual"/-->

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="CoreOther"     n="1"                           name="Remote control signal preprocessor (RMC)"/>
          <feature type="IOs"           n="47"/>
          <feature type="VCC"           n="3.90"    m="5.50"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'TMPM383FSUG'  ***************************** -->
        <device Dname="TMPM383FSUG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM383.h"/>
          <debug svd="SVD/M383.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM383_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM383FSUG Reference Manual"/-->

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="CoreOther"     n="1"                           name="Remote control signal preprocessor (RMC)"/>
          <feature type="IOs"           n="47"/>
          <feature type="VCC"           n="3.90"    m="5.50"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'TMPM383FSEFG'  **************************** -->
        <device Dname="TMPM383FSEFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM383.h"/>
          <debug svd="SVD/M383.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM383_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM383FSEFG Reference Manual"/-->

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="CoreOther"     n="1"                           name="Remote control signal preprocessor (RMC)"/>
          <feature type="IOs"           n="47"/>
          <feature type="VCC"           n="3.90"    m="5.50"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'TMPM384FDFG'  ***************************** -->
        <device Dname="TMPM384FDFG">
          <processor Dclock="40000000"/>
          <compile header="Device/Include/TMPM384.h"/>
          <debug svd="SVD/M384.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM38x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM384FDFG Reference Manual"/-->

          <feature type="DMA"           n="2"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="Timer"         n="12"      m="16"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="IOs"           n="121"/>
          <feature type="VCC"           n="4.00"    m="5.50"/>
          <feature type="QFP"           n="144"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'M390'  **************************** -->
      <subFamily DsubFamily="M390">
        <feature type="UART"          n="3"                           name="UART/SIO"/>
        <feature type="I2C"           n="1"/>
        <feature type="I2C"           n="1"                           name="I2C/SIO"/>
        <feature type="ADC"           n="12"      m="10"/>
        <feature type="Timer"         n="10"      m="16"/>
        <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
        <feature type="Other"         n="2"                           name="Remote Control Preprocessor"/>
        <feature type="RTC"           n="1"       m="32768"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>
        <feature type="Temp"          n="-40"     m="85"/>

