saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM3_DFP.1.4.0.pdsc
    <!-- Startup TMPM380 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM380 CMSIS">
      <description>System Startup for Toshiba TMPM380 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM380.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM380.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM381 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM381 CMSIS">
      <description>System Startup for Toshiba TMPM381 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM381.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM381.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM383 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM383 CMSIS">
      <description>System Startup for Toshiba TMPM383 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM383.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM383.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM384 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM384 CMSIS">
      <description>System Startup for Toshiba TMPM384 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM384.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM384.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM390 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM390 CMSIS">
      <description>System Startup for Toshiba TMPM390 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM390.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM390.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM395 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM395 CMSIS">
      <description>System Startup for Toshiba TMPM395 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM395.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_TMPM395.c"         attr="config" version="1.0.0"/>
      </files>
    </component>
    
    <bundle Cbundle="EB_TMPM369FDFG" Cclass="Board Support" Cversion="1.0.0">
      <description>Yokogawa EB_TMPM369FDFG Development Board</description>
      <doc>Documents/</doc>
      <component Cgroup="LED" Capiversion="1.00" condition="TMPM369FDFG CMSIS Device">
        <description>LED driver for YDC EB-TMPM369FDFG Development Board</description>
        <files>
          <file category="sourceC" name="Boards/Yokogawa/Common/LED_EB_TMPM369FDFG.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="TMPM369FDFG CMSIS Device">
        <description>Button driver for YDC EB-TMPM369FDFG Development Board</description>
        <files>
          <file category="sourceC" name="Boards/Yokogawa/Common/Buttons_EB_TMPM369FDFG.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="Keil" name="MCBTMPM330" revision="v1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBTMPM330=ON">
      <description>Keil MCBTMPM330 Board Support and Examples</description>
      <image small="Images/mcbtmpm330_board.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcbtmpm330/" title="MCBTMPM330 Web Page"/>
      <book category="schematic" name="Documents/mcbtmpm330-schematics.pdf" title="Schematics"/>
      <book category="manual"    name="Documents/mcbtmpm330.chm" title="User Manual" />
      <mountedDevice    deviceIndex="0" Dvendor="Toshiba:92" Dname="TMPM330FDFG"/>
      <compatibleDevice deviceIndex="0" Dvendor="Toshiba:92" DsubFamily="M330"/>
      <feature type="XTAL"      n="10000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"              name="Push-buttons: DPH1, NMI and Reset"/>
      <feature type="LED"       n="3"              name="LEDs: Power, User: green, yellow, red"/>
      <feature type="Poti"      n="1"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug &amp; Trace Interface"/>
      <feature type="CustomFF"  n="100" m="70"/>
    </board>
    
    <board vendor="Keil" name="MCBTMPM360" revision="v1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBTMPM360=ON">
      <description>Keil MCBTMPM360 Board Support</description>
      <image small="Images/mcbtmpm360_board_small.jpg" large="Images/mcbtmpm360_board_big.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcbtmpm360/" title="MCBTMPM360 Web Page"/>
      <book category="schematic" name="Documents/MCBTMPM360v1-1.PDF" title="Schematics"/>
      <book category="manual"    name="Documents/mcbtmpm360.chm" title="User Manual" />
      <mountedDevice    deviceIndex="0" Dvendor="Toshiba:92" Dname="TMPM362F10FG"/>
      <mountedDevice    deviceIndex="0" Dvendor="Toshiba:92" Dname="TMPM364F10FG"/>
      <compatibleDevice deviceIndex="0" Dvendor="Toshiba:92" DsubFamily="M360"/>
      <feature type="XTAL"      n="12000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="6"              name="Push-buttons: PJ4/5/6/7, NMIn and Reset"/>
      <feature type="LED"       n="5"              name="LEDs: Power, User: green"/>
      <feature type="USB"       n="1"              name="USB 2.0 Host (TMPM364 only)"/>
      <feature type="CAN"       n="1"              name="CAN 2.0 Interface (TMPM364 only)"/>
      <feature type="DIO"       n="120"/>
      <feature type="Poti"      n="1"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug &amp; Trace Interface"/>
      <feature type="CustomFF"  n="135" m="60"/>
      <feature type="Curr"      n="15"  m="25"/>
    </board>
    
