saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM3_DFP.1.4.0.pdsc
    <board vendor="Keil" name="MCBTMPM395" revision="v1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBTMPM395=ON">
      <description>Keil MCBTMPM395 Board Support</description>
      <image small="Images/mcbtmpm395_board_small.jpg" large="Images/mcbtmpm395_board_big.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcbtmpm395/" title="MCBTMPM395 Web Page"/>
      <book category="schematic" name="Documents/mcbtmpm395-schematics.pdf" title="Schematics"/>
      <book category="manual"    name="Documents/mcbtmpm395.chm" title="User Manual" />
      <mountedDevice    deviceIndex="0" Dvendor="Toshiba:92" Dname="TMPM395FWAXBG"/>
      <compatibleDevice deviceIndex="0" Dvendor="Toshiba:92" DsubFamily="M390"/>
      <feature type="XTAL"      n="12000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="6"              name="Push-buttons: 4x GPIO, NMI and Reset"/>
      <feature type="LED"       n="5"              name="LEDs: Power, 2x User: green"/>
      <feature type="USB"       n="1"/>
      <feature type="DIO"       n="57"/>
      <feature type="Poti"      n="1"/>
      <feature type="RS232"     n="1"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug &amp; Trace Interface"/>
      <feature type="CustomFF"  n="135" m="69"/>
      <feature type="Curr"      n="10"  m="15"/>
    </board>

    <board vendor="Toshiba" name="BMSKTOPASM369" revision="v1" salesContact="http://www.toshiba-components.com/microcontroller/Cortex_SKs.html" orderForm="http://www.toshiba-components.com/microcontroller/Cortex_SKs.html">
      <description>Toshiba BMSKTOPASM369 Board Support and Examples</description>
      <image small="Boards/Toshiba/BMSKTOPASM369/Documents/BMSKTOPASM369_small.png"
             large="Boards/Toshiba/BMSKTOPASM369/Documents/BMSKTOPASM369_large.png"/>
      <book category="overview" name="Boards/Toshiba/BMSKTOPASM369/Documents/6154E.pdf" title="Overview"/>
      <mountedDevice    deviceIndex="0" Dvendor="Toshiba:92" Dname="TMPM369FDFG"/>
      <compatibleDevice deviceIndex="0" Dvendor="Toshiba:92" DsubFamily="M360"/>
      <feature type="XTAL"      n="16000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="ETH"       n="1"              name="10/100MBit Ethernet"/>
      <feature type="MemCard"   n="1"              name="MicroSD Card Holder"/>
      <feature type="PWR"       n="5" m="12"       name="Extern Powered"/>
      <feature type="Joystick"  n="1"              name="5-position Joystick"/>
      <feature type="USB"       n="1"              name="Full-Speed USB device"/>
      <feature type="USB"       n="1"              name="Full-Speed USB host"/>
      <feature type="LED"       n="8"              name="LEDs: User: green"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug &amp; Trace Interface"/>
    </board>
    
    <board vendor="Yokogawa" name="EB_TMPM369FDFG" revision="v1"> <!--- salesContact="" orderForm="" -->
      <description>Yokogawa EB_TMPM369FDFG Board Support</description>
      <image small="Images/EB_TMPM369FDFG_board_small.jpg" large="Images/EB_TMPM369FDFG_board_big.png"/>
      <!-- book category="overview"  name="http://www.keil.com/" title="TMPM369FDFG Web Page"/ -->
      <book category="schematic" name="Documents/EB_TMPM369FDFG_Schematic.pdf" title="Schematics"/>
      <book category="manual"    name="Documents/EB_TMPM369FDFG Users Manual.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Toshiba:92" Dname="TMPM369FDFG"/>
      <compatibleDevice deviceIndex="0" Dvendor="Toshiba:92" DsubFamily="M360"/>
      <feature type="XTAL"      n="16000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="6"              name="Push-buttons: PC0,1,2,3, NMI and Reset"/>
      <feature type="LED"       n="5"              name="LEDs: Power, User: green: PC4,5,6,7"/>
      <feature type="USB"       n="1"              name="USB 2.0 Host"/>
      <feature type="USB"       n="1"              name="USB 2.0 Device"/>
      <feature type="CAN"       n="1"              name="CAN 2.0B Interface"/>
      <feature type="ETH"       n="1"              name="10/100Base-T"/>
      <feature type="DIO"       n="120"/>
      <feature type="Poti"      n="2"/>
      <feature type="RS232"     n="2"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug &amp; Trace Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug Interface"/>
      <feature type="CustomFF"  n="135" m="100"/>
    </board>

  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCBTMPM330/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCBTMPM330" vendor="Keil" Dvendor="Toshiba:92" Dname="TMPM330FDFG"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCBTMPM360/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCBTMPM360" vendor="Keil" Dvendor="Toshiba:92" Dname="TMPM364F10FG"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCBTMPM395/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCBTMPM395" vendor="Keil" Dvendor="Toshiba:92" Dname="TMPM395FWAXBG"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Toshiba/BMSKTOPASM369/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="BMSKTOPASM369" vendor="Toshiba" Dvendor="Toshiba:92" Dname="TMPM369FDFG"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- YDC EB_TMPM369FDFG Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Yokogawa/Examples/Blinky">
      <description>Blinky example</description>
      <board name="EB_TMPM369FDFG" vendor="Yokogawa"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Yokogawa/Examples/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EB_TMPM369FDFG" vendor="Yokogawa"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>

</package>
